app/controllers/buy_lists_controller.rb

  def index
    @buy_lists = BuyList.all
---
SELECT "buy_lists".* FROM "buy_lists"

  def create
    @buy_list = BuyList.new(buy_list_params)

    respond_to do |format|
      if @buy_list.save
---
INSERT INTO "buy_lists" ("date", "location", "total", "list", "shopping_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @buy_list.destroy
---
DELETE FROM "buy_lists" WHERE "buy_lists"."id" = ?  [["id", 1]]

    def set_buy_list
      @buy_list = BuyList.find(params[:id])
---
SELECT "buy_lists".* FROM "buy_lists" WHERE "buy_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]