app/controllers/family_members_controller.rb

  def index
    @family_members = FamilyMember.all
---
SELECT "family_members".* FROM "family_members"

  def create
    @family_member = FamilyMember.new(family_member_params)

    respond_to do |format|
      if @family_member.save
---
INSERT INTO "family_members" ("f_id", "m_id", "name", "dob", "role", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @family_member.destroy
---
DELETE FROM "family_members" WHERE "family_members"."id" = ?  [["id", 1]]

    def set_family_member
      @family_member = FamilyMember.find(params[:id])
---
SELECT "family_members".* FROM "family_members" WHERE "family_members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]