app/controllers/families_controller.rb

SELECT "families".* FROM "families"
---
  def index
    @families = Family.all