app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    @feeds = Feed.all