app/controllers/inventory_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    @inventory = Inventory.all

INSERT INTO "inventories" ("item_id", "item_name", "item_qty", "item_purchase_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", "s"], ["item_name", "s"], ["item_qty", 1], ["item_purchase_date", "s"], ["created_at", "2022-07-25 08:31:15.976549"], ["updated_at", "2022-07-25 08:31:15.976549"]]
---
  def create
    @inventory = Inventory.new(inventory_params)


    if @inventory.save

SELECT "inventories".* FROM "inventories" WHERE "inventories"."item_id" = ? LIMIT ?  [["item_id", "s"], ["LIMIT", 1]]
---
  def edit
    @inventory = Inventory.find_by_item_id(params[:item_id])

UPDATE "inventories" SET "item_qty" = ?, "updated_at" = ? WHERE "inventories"."id" = ?  [["item_qty", 5], ["updated_at", "2022-07-25 09:58:21.980418"], ["id", 3]]
---
  def update
    @inventory = Inventory.find_by_item_id(params[:item_id])

    if @inventory.update(inventory_params)