app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "confirmed_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["email", "panpan@mail.com"], ["created_at", "2022-07-27 03:44:05.184249"], ["updated_at", "2022-07-27 03:44:05.184249"], ["confirmed_at", nil], ["password_digest", "[FILTERED]"]]
---
    def create
      @user = User.new(user_params)
      if @user.save